import java.util.Arrays;

// Реализуйте алгоритм сортировки пузырьком числового массива (введён вами),
// результат после каждой итерации запишите в лог-файл.

public class proj {

    public static void main(String[] args) {
        int[] numbers =  new int[] {4,2,1,6,5,8,9,7,3};
        System.out.println(Arrays.toString(numbers));
    }
}